Here is the full output of a fresh machine from this morning
```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "ovmf"
      + boot_order              = [
          + "scsi0",
        ]
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "test.unicornafk.fr"
      + network_interface_names = (known after apply)
      + node_name               = "server3"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-single"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "ansible_managed",
          + "dhcp",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full    = true
          + retries = 1
          + vm_id   = 114
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + flags        = []
          + hotplugged   = 0
          + numa         = false
          + sockets      = 1
          + type         = "x86-64-v2-AES"
          + units        = 1024
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "SERVER3-SSD1"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + size              = 20
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + interface            = "ide2"
          + meta_data_file_id    = "local:snippets/test.unicornafk.fr-ci-meta_data.yml"
          + network_data_file_id = "local:snippets/test.unicornafk.fr-ci-network.yml"
          + user_data_file_id    = "local:snippets/test.unicornafk.fr-ci-user.yml"
        }

      + memory {
          + dedicated = 4096
          + floating  = 0
          + shared    = 0
        }

      + network_device {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 10
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vm_id       = (known after apply)
proxmox_virtual_environment_vm.vm: Creating...
proxmox_virtual_environment_vm.vm: Still creating... [10s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [20s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [30s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [40s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [50s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [1m0s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [1m10s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [1m20s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [1m30s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [1m40s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [1m50s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [2m0s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [2m10s elapsed]
proxmox_virtual_environment_vm.vm: Provisioning with 'local-exec'...
proxmox_virtual_environment_vm.vm (local-exec): Executing: ["/bin/sh" "-c" "ansible all -i 192.168.10.234, -m shell -a '/usr/bin/cloud-init status --wait' --ssh-common-args='-o StrictHostKeyChecking=no -o userknownhostsfile=/dev/null'"]
proxmox_virtual_environment_vm.vm: Still creating... [2m20s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [2m30s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [2m40s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [2m50s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [3m0s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [3m10s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [3m20s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [3m30s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [3m40s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [3m50s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [4m0s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [4m10s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [4m20s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [4m30s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [4m40s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [4m50s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [5m0s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [5m10s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [5m20s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [5m30s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [5m40s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [5m50s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [6m0s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [6m10s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [6m20s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [6m30s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [6m40s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [6m50s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [7m0s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [7m10s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [7m18s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [7m28s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [7m38s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [7m48s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [7m58s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [8m8s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [8m18s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [8m28s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [8m38s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [8m48s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [8m58s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [9m8s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [9m18s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [9m28s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [9m38s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [9m48s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [9m58s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [10m8s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [10m18s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [10m28s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [10m38s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [10m48s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [10m58s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [11m8s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [11m18s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [11m28s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [11m38s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [11m48s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [11m58s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [12m8s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [12m18s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [12m28s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [12m38s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [12m48s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [12m58s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [13m8s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [13m18s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [13m28s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [13m38s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [13m48s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [13m58s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [14m8s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [14m18s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [14m28s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [14m38s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [14m48s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [14m58s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [15m8s elapsed]
proxmox_virtual_environment_vm.vm: Still creating... [15m18s elapsed]
proxmox_virtual_environment_vm.vm (local-exec): 192.168.10.234 | CHANGED | rc=0 >>
proxmox_virtual_environment_vm.vm (local-exec): ..............................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................
proxmox_virtual_environment_vm.vm (local-exec): status: done
proxmox_virtual_environment_vm.vm: Creation complete after 15m19s [id=104]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

domain = "unicornafk.fr"
server_used = "server3"
vm_hostname = "test"
vm_id = "104"
vm_ip = "192.168.10.234"
vm_ip6 = "2a0c:b641:2c0:110::234"
vm_tags = tolist([
  "ansible_managed",
  "dhcp",
])
```

The new plan gives
```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_vm.vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      ~ id                      = "104" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.10.234",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "2a0c:b641:2c0:110::234",
              - "fe80::be24:11ff:fe87:2d39",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:87:2D:39",
        ] -> (known after apply)
        name                    = "test.unicornafk.fr"
      ~ network_interface_names = [
          - "lo",
          - "enp6s18",
        ] -> (known after apply)
        tags                    = [
            "ansible_managed",
            "dhcp",
        ]
      ~ vm_id                   = 104 -> (known after apply)
        # (20 unchanged attributes hidden)

      ~ clone {
          ~ vm_id   = 114 -> 111 # forces replacement
            # (2 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ path_in_datastore = "vm-104-disk-1" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ network_device {
          ~ mac_address = "BC:24:11:87:2D:39" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ vm_id       = "104" -> (known after apply)
```